Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElements Property
 Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRoomBoundingElements { get; }
Public Shared ReadOnly Property NoRoomBoundingElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRoomBoundingElements {
	FailureDefinitionId^ get ();
}
static member NoRoomBoundingElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace